let num = parseInt(prompt("Введіть число."));
if (num < 3 || num % 3 !== 0) {
    console.log("Це число не можна отримати, піднявши число 3 до певного натурального ступеня.");
} else {
    let a = 3;
    while (num > a){
        a *= 3;
    }
    if (num === a){
        console.log("Це число можна отримати, піднявши число 3 до певного натурального ступеня.");
    } else {
        console.log("Це число не можна отримати, піднявши число 3 до певного натурального ступеня.");
    }
}

/*друге рішення*/

/*let num = parseInt(prompt("Введіть число."));
if (num < 3 || num % 3 !== 0){
    console.log("Це число не можна отримати, піднявши число 3 до певного натурального ступеня.")
} else {
    for (num; num >= 3; num = num / 3){
        let result = num / 3;
        if (result === 3 || result === 1){
            console.log("Це число можна отримати, піднявши число 3 до певного натурального ступеня.");
            break;
        } else if(result % 3 !== 0){
            console.log("Це число не можна отримати, піднявши число 3 до певного натурального ступеня.");
        }
    }
}*/
